perf/news.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555/api'
      http:
        timeout: 2
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Warmup
      duration: 30
      arrivelRate: 10
      rampTo: 30

    - name: Ramp
      duration: 60
      arrivalRate: 30
      rampTo: 100

    - name: Plain
      duration: 15
      arrivalRate: 100
    

scenarios:
  - name: Spaceflight News (/spaceflight_news)
    flow:
      - get:
          url: '/spaceflight_news'

# Posibles Soluciones:
# CACHE
# Rate-Limiting
# Replication