perf/ping.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555/api'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Warmup
      duration: 60
      arrivelRate: 1
      rampTo: 3

    - name: Ramp
      duration: 60
      arrivalRate: 3
      rampTo: 20 

    - name: Plain
      duration: 30
      arrivalRate: 20
    

scenarios:
  - name: Ping (/ping)
    flow:
      - get:
          url: '/ping'