perf/quote.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555/api'
      http:
        timeout: 1
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Warmup
      duration: 30
      arrivelRate: 2
      rampTo: 4

    - name: Ramp
      duration: 60
      arrivalRate: 4
      rampTo: 8

    - name: Plain
      duration: 15
      arrivalRate: 8
    

scenarios:
  - name: Quote (/quote) # API rate limit = 180 rq/min
    flow:
      - get:
          url: '/quote'

# Posibles Soluciones:
# CACHE
# Rate-Limiting